app/Controllers/Dashboard.php

    public function adminLoginSession()
    {
        $session = session();
        $userModel = new Registerusers_model();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aditya@avhadenterprises.com'
 LIMIT 1