app/Controllers/UserEventLogger.php

    public function logUserEvents()
    {
        $eventModel = new UserEventModel();
        $data = $this->request->getJSON(true);

        if (isset($data['events']) && is_array($data['events'])) {
            foreach ($data['events'] as $event) {
                $eventData = [
                    'name' => $event['name'],
                    'visitor_id' => $event['visitor_id'],
                    'session_id' => $event['session_id'],
                    'event_type' => $event['event_type'],
                    'event_data' => json_encode($event['event_data']),
                    'timestamp' => $event['timestamp']
                ];

                $eventModel->insert($eventData);
---
INSERT INTO `user_events` (`name`, `visitor_id`, `session_id`, `event_type`, `event_data`, `timestamp`) VALUES (NULL, 'visitor_rbu8yyd1v', 'session_z7m5gsig1', 'click', '{\"element\":\"path\",\"id\":\"\",\"classes\":[],\"device_type\":\"Windows\"}', '2024-10-02T07:08:36.532Z')