app/Models/brands_model.php

SELECT *
FROM `brands`
---
    public function getBrands()
    {
        return $this->findAll();