app/Models/CarouselModel.php

    public function findallpublicdeals()
    {
        $deals = $this->db->table('deals')->orderBy('deal_order', 'ASC')->where('visibility', 1)->get()->getResultArray();
---
SELECT *
FROM `deals`
WHERE `visibility` = 1
ORDER BY `deal_order` ASC

    public function findpublicbrandteasres()
    {
        $brandteasers = $this->db->table('brand_teasers')->orderBy('order', 'ASC')->where('visibility', 1)->get()->getResultArray();
---
SELECT *
FROM `brand_teasers`
WHERE `visibility` = 1
ORDER BY `order` ASC

    public function getallcatpills()
    {
        return $this->db->table('category_pills')->orderBy('pills_order', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `category_pills`
ORDER BY `pills_order` ASC

    public function findbrandpromos()
    {
        $brandpromos = $this->db->table('brand_promo')->get()->getResultArray();
---
SELECT *
FROM `brand_promo`

    public function getbrandimage($brandid)
    {
        return $this->db->table('brands')->where('brand_id', $brandid)->select('logo')->get()->getRowArray();
---
SELECT `logo`
FROM `brands`
WHERE `brand_id` = '17'

    public function findbrandbanner()
    {
        $brandpromo = $this->db->table('brand_promo')->where('is_default', 1)->get()->getResultArray();
---
SELECT *
FROM `brand_promo`
WHERE `is_default` = 1

    public function findproductsgrid()
    {
        $products = $this->db->table('product_grid')->get()->getResultArray();
---
SELECT *
FROM `product_grid`

    public function getcollectiondata($id)
    {
        return $this->db->table('collection_products')->where('collection_id', $id)->limit(6)->get()->getResultArray();
---
SELECT *
FROM `collection_products`
WHERE `collection_id` = '142'
 LIMIT 6

    public function getcategorytrio()
    {
        $catrio = $this->db->table('category_trio')->orderBy('trio_order', 'ASC')->where('trio_visibility', 1)->get()->getResultArray();
---
SELECT *
FROM `category_trio`
WHERE `trio_visibility` = 1
ORDER BY `trio_order` ASC