app/Models/Cart_model.php

    public function getCartItemCount($user_id)
    {
        return $this->where('user_id', $user_id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `user_id` = '201'