app/Models/Controls_model.php

SELECT *
FROM `menu_links`
---
    public function getMenuLinks()
    {
        return $this->db->table('menu_links')->get()->getResultArray();

SELECT *
FROM `navbar_links`
---
    public function getsecMenuLinks()
    {
        return $this->db->table('navbar_links')->get()->getResultArray();