app/Models/Products_model.php

    public function getcollectionsdata()
    {
        $collections = $this->db->table('collection')->get()->getResultArray();
---
SELECT *
FROM `collection`