app/Models/Products_model.php

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `product_status` = 'active'
---
    public function getPublicProducts()
    {
        return $this->where('product_status', 'active')->countAllResults();